{
  "education": [
    {
      "awards_achievements": [
        "Excellence Scholarship (2020)",
        "First Class Honours",
        "GPA: 3.73/4.0"
      ],
      "degree": "Bachelor of Sciences",
      "department": "Honours Computer Science",
      "duration": "2020-2023",
      "school_name": "McGill University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-swzn",
  "highlighted_projects": [
    {
      "description": "Applied multiple software architecture and OOP principles to create scalable software. Designed and implemented search algorithms to analyze public data on Facebook. Designed a GUI with JavaFX to make the tool easy to use. Created a tree-based data structure to encode data in JSON format. Wrote a 18 page scientific report on findings made using the software. Technologies used: Git, Java, JavaFX, Maven, Selenium, Python, NLP.",
      "git_url": "https://github.com/swzn/FacebookWebScraper",
      "name": "FacebookWebScraper"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Sajad Wazin",
  "others": [
    {
      "bullets": [
        "SEBIQ Diploma",
        "IB Certification"
      ],
      "title": "Certificates"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Participated in daily Scrum meetings. Developed software using Java, RDBMS, Linux/Bash and GCP. Worked cooperatively to complete tasks on product backlog. Participated in multiple master code reviews and interview sessions.",
      "duration": "June 2023-present",
      "title": "Software Developer"
    },
    {
      "company": "GemPixel",
      "description": "Wrote and designed software to handle payments from different payment gateways in PHP using HTML/CSS. Implemented payment systems using REST APIs from PayPal, Stripe, Clover, WayForPay, Mercado Pago and JQuery as a frontend. Developed and deployed custom plugins in a SaaS business model. Worked on a Machine Learning model with PyTorch to detect spam links.",
      "duration": "August 2022 - January 2023",
      "title": "Software Developer"
    },
    {
      "company": "McGill University",
      "description": "Lead an independent research project based around studying algorithms, mainly focusing on artificial intelligence.",
      "duration": "May 2022 - August 2022",
      "title": "Research Developer"
    },
    {
      "company": "Apple",
      "description": "Inventory management with SAP ERP and GBI Tableau. Work as a team to complete the daily tasks and inventory reception. Communicate with managers on a regular basis to work on team performance. Be a part of daily meetings. Provide and receive constructive feedback.",
      "duration": "August 2021-present",
      "title": "Operations Specialist"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "CSS",
      "JavaScript/TypeScript",
      "Spring",
      "PHP",
      "Selenium",
      "JUnit",
      "Pandas/Numpy/PyTorch/TensorFlow",
      "Maven",
      "Jira/Atlassian"
    ],
    "familiar": [
      "React",
      "Angular",
      "Docker",
      "Hadoop",
      "OCaml",
      "OpenGL"
    ],
    "proficient": [
      "Java",
      "Python",
      "C/C++",
      "Linux/Bash",
      "RDBMS/SQL",
      "Data Structures and Algorithms",
      "AI/ML",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a software developer, specialising in backend development. Since 2016, I have been working on projects in a variety of fields, all at different levels of difficulty. My main programming languages are Java, C/C++ and Python, with a heavy focus on software architecture, data science and algorithms. During my 3 years Bachelor of Science program at McGill University, I was able to gather a variety of skills that aid me on a daily basis. Among those skills are the ability to design secure and optimized software, the ability to analyze and develop complex algorithms and the ability to use my knowledge of software development in combination with mathematics to deliver a fault-proof product. Furthermore, in combination with my research at McGill University, understanding and developing conscious, reliable and expandable software is an important part of all my tasks."
}
